/*
  Localizable.strings
  FlavorTrack

  Created by Joe Pham on 2023-01-18.
  
*/

/* ALERT TITLES & MESSAGES */

"Something bad happened" = "Có lỗi xảy ra";
"The inputs created an invalid request. Please retry." = "Dữ liệu đầu vào gây lỗi request. Xin thử lại.";
"Unable to complete your request. Please check your internet connection." = "Không thể hoàn thành yêu cầu. Xin kiểm tra lại kết nối internet.";
"Invalid response from server. Please retry." = "Phản hồi sai từ máy chủ. Xin thử lại.";
"Invalid data received from server. Please retry." = "Dữ liệu sai từ máy chủ. Xin thử lại.";
"Favorited!" = "Đã lưu ưa thích!";
"Uh-oh!" = "Ui cha!";
"Successfully saved %@ to favorites" = "Đã lưu thành công %@ vào DS ưa thích";
"Unable to favorite 🙁" = "Không lưu được vào DS ưa thích 🙁";
"Unable to retrieve favorites from local storage 🥲" = "Không tải được DS ưa thích từ bộ nhớ trong 🥲";
"You already favorited this place. Nothing else to be done here 😄" = "Bạn đã lưu nơi này vào DS ưa thích. Không cần làm lại nữa đâu 😄";


/* SEARCH SCREEN */

/* Screen title */
"Search" = "Tìm kiếm";
/* Others */
"Your current whereabouts?" = "Vị trí để tìm xung quanh?";
"What are you craving?" = "Bạn đang thèm món gì?";
"Let's go!" = "Bắt đầu thôi!";

/* Input validation */
"No Location?" = "Không rõ Vị trí sao?";
"Please enter an address, road name, or zip code, etc.\nThen we can search 😊." = "Hãy điền 1 địa chỉ, tên đường, hay mã zip gần bạn.\nRồi ta có thể bắt đầu tìm 😊";
"Unsure what to find?" = "Bạn chưa biết nên tìm món gì?";
"Please enter a business type.\nHow about 'vietnamese', or 'coffee'?" = "Hãy thử điền 'vietnamese' để tìm món Việt, hoặc 'coffee' xem?";

/* FAVORITES SCREEN */
"Favorite Places" = "Nơi Ưa Thích";
"No favorite places added yet!\nGo add some 😊" = "Chưa có mục nào cả!\nBạn hãy thêm vài nơi nhé 😊";


/* BUSINESS LIST SCREEN */

/* Screen title */
"%@ near %@" = "%@ gần %@";
/* Search bar */
"Search a name" = "Tìm theo tên";
/* Empty state */
"No results matching what you're looking for 😢" = "Không tìm được kết quả nào cho yêu cầu của bạn 😢";


/* BUSINESS INFO HEADER VIEW */

"%@m from %@" = "%@m từ %@";
"%@km from %@" = "%@km từ %@";
"Searched Location" = "Vị trí đã tìm";
"searched location" = "vị trí đã tìm";
"Is open or closed?" = "Còn kinh doanh hay không?";
"Closed from Public" = "Không còn kinh doanh";
"Open to Public" = "Vẫn kinh doanh";

/* The noun */
"Cost" = "Giá cả";
/* The noun */
"Distance" = "Khoảng cách";
/* The noun */
"Rating" = "Đánh giá";


/* BUSINESS INFO DETAIL VIEW */

"Find out more on Yelp" = "Tìm hiểu thêm trên Yelp";


/* BUSINESS INFO MAP VIEW */

"Take me there!" = "Dẫn đường cho tôi!";
